KansOptTorg Configuration/src/Documents/ЗакрнытиеМесяца/ЗакрнытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрнытиеМесяца</name>
  <registerRecords>AccountingRegister.РегистрБух</registerRecords>
</mdclass:Document>

KansOptTorg Configuration/src/AccountingRegisters/РегистрБух/РегистрБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБух</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

KansOptTorg Configuration/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1        </code>
    </items>
    <items>
      <name>РасчетыСПостащиками</name>
      <description>Расчеты с постащиками</description>
      <code>2        </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>3        </code>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>4        </code>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
      <code>5        </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>6        </code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>7        </code>
    </items>
    <items>
      <name>ПрибыльИУбытки</name>
      <description>Прибыль и убытки</description>
      <code>8        </code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

KansOptTorg Configuration/src/Documents/ЗакрнытиеМесяца/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	КонецПериода = КонецМесяца(Дата)+1;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрБухОстатки.Счет,
		|	РегистрБухОстатки.СуммаОстатокДт,
		|	РегистрБухОстатки.СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрБух.Остатки(&Период, Счет В (&СчетВыручка, &СчетСебестоимость),) КАК РегистрБухОстатки";
	
	Запрос.УстановитьПараметр("СчетВыручка", ПланыСчетов.БухУчет.Выручка);
	Запрос.УстановитьПараметр("СчетСебестоимость", ПланыСчетов.БухУчет.Себестоимость);
	Запрос.УстановитьПараметр("Период", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОстатокВыручки =0;
	ОстатокСебестоимости =0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Выручка тогда
			ОстатокВыручки = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
		ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Себестоимость тогда
			ОстатокСебестоимости = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.РегистрБух.Записывать = истина;
	
	Проводка = Движения.РегистрБух.Добавить();
	
	Проводка.Период = Дата;
	Проводка.Сумма = ОстатокВыручки;
	Проводка.СчетДт = ПланыСчетов.БухУчет.Выручка;
	//Не уверен, почему нельзя было использловать расчеты с покупателями, так как это тоже своего рода прибыль
	Проводка.СчетКт = ПланыСчетов.БухУчет.ПрибыльИУбытки; 
	
	Проводка = Движения.РегистрБух.Добавить();
	
	Проводка.Период = Дата;
	Проводка.Сумма = ОстатокСебестоимости;
	Проводка.СчетДт = ПланыСчетов.БухУчет.ПрибыльИУбытки;
	Проводка.СчетКт = ПланыСчетов.БухУчет.Себестоимость;
	
КонецПроцедуры
